create_clock -name adc_clk -period 1.666 [get_ports adc_clk]
create_generated_clock -name fft_clk -source [get_ports adc_clk] -divide_by 4 [get_pins divider/_4_/Q ]
set_multicycle_path -setup 4 -from [get_clocks fft_clk] -to [get_clocks adc_clk]
set_multicycle_path -hold 3 -from [get_clocks fft_clk] -to [get_clocks adc_clk]
set_multicycle_path 3 -setup -from [get_pins stp_im/genblk1[*].stp/*/CLK] -to [get_clocks fft_clk]
set_multicycle_path 2 -hold  -from [get_pins stp_im/genblk1[*].stp/*/CLK] -to [get_clocks fft_clk]
set_multicycle_path 3 -setup -from [get_pins stp_re/genblk1[*].stp/*/CLK] -to [get_clocks fft_clk]
set_multicycle_path 2 -hold  -from [get_pins stp_re/genblk1[*].stp/*/CLK] -to [get_clocks fft_clk]
set_multicycle_path 3 -setup -from [get_pins stp_im/stp0/*/CLK] -to [get_clocks fft_clk]
set_multicycle_path 2 -hold  -from [get_pins stp_im/stp0/*/CLK] -to [get_clocks fft_clk]
set_multicycle_path 3 -setup -from [get_pins stp_re/stp0/*/CLK] -to [get_clocks fft_clk]
set_multicycle_path 2 -hold  -from [get_pins stp_re/stp0/*/CLK] -to [get_clocks fft_clk]
set_max_fanout 16 [current_design]
set_max_transition 1.5 [current_design]
